{"articleList":
[{
	"articleId":"00001",
	"title":"Tim Fox: What's new in Vert.x 2.0",
	"author":"Ralph Winzinger",
	"leading":"In recent years, new trends like mobile clients and social networks forced web applications to handle more and more concurrent connections.",
	"source":"http://www.infoq.com",
	"created":1375154731000,
	"type":"TYPE1",
	"isFavorite":"true",
	"likeNum":1,
	"commentNum":12
},
{
	"articleId":"00002",
	"title":"From Groovy to Java 8 ",
	"leading":"Groovy developers will have a head-start in adopting the concepts and new language constructs offered by Java 8. Many of the enhancements offered in the upcoming version of Java are features that Groovy has offered for years.",
	"author":"Dan Woods",
	"source":"http://www.infoq.com",
	"created":1375254631000,
	"type":"TYPE1",
	"isFavorite":"false",
	"likeNum":0,
	"commentNum":2
},
{
	"articleId":"00003",
	"title":"Major Software Development Trends for 2013",
	"leading":"With 2012 coming to an end and everybody talking about what lies ahead in 2013, InfoQ has conducted a quick poll amongst its editors about the trends that have a good potential to get significant traction or even dominated the software development community during the next year. These trends include everything from specific programming languages, platforms, development methodologies, and more.",
	"author":"Dio-Synodinos",
	"source":"http://www.infoq.com",
	"created":1375225688000,
	"type":"TYPE2",
	"isFavorite":"true",
	"likeNum":1,
	"commentNum":1
},
{
	"articleId":"00004",
	"title":"PostSharp Has Just Gotten Much Easier",
	"leading":"PostSharp 3.0 brings with it deep integration with Visual Studio and NuGet. With a couple of mouse clicks PostSharp can apply aspects to a method in a clean project.",
	"author":"Jonathan Allen",
	"source":"http://www.infoq.com",
	"created":1375081931000,
	"type":"TYPE2",
	"isFavorite":"false",
	"likeNum":0,
	"commentNum":0
},{
	"articleId":"00005",
	"title":"NoSQL Database Adoption Trends",
	"leading":"UPDATE Jul 25 2013: The following options were added today, after user request: Oracle Coherence, Terracotta BigMemory, Couchbase, and Oracle NoSQL Database.",
	"author":"Srini Penchikala",
	"source":"http://www.infoq.com",
	"created":1375174231000,
	"type":"TYPE2",
	"isFavorite":"false",
	"likeNum":0,
	"commentNum":0
},
{
	"articleId":"00006",
	"title":"Top Application Lifecycle Management (ALM) Toolsets",
	"leading":"In the recent past there has been a sudden upsurge in the number of competing Application lifecycle management (ALM) offerings from vendors that previously offered a subset of the toolset.",
	"author":"Jeevak-Kasarkod",
	"source":"http://www.infoq.com",
	"created":1375168331000,
	"type":"TYPE2",
	"isFavorite":"true",
	"likeNum":2,
	"commentNum":1
},
{
	"articleId":"00007",
	"title":"Exploring the Architecture of the NuoDB Database, Part 2",
	"leading":"In Part 1 of this article we have introduced NuoDB and covered some of its main features: 3-tiered architecture, nodes are equal peers, Atoms - the fundamental data unit, and the versioning and concurrency system used to handle data update conflicts and implement consistency. ",
	"author":"Seth Proctor",
	"source":"http://www.infoq.com",
	"created":1375081921000,
	"type":"TYPE2",
	"isFavorite":"false",
	"likeNum":3,
	"commentNum":2
},
{
	"articleId":"00008",
	"title":"Spoilt for Choice - How to choose the right Big Data / Hadoop Platform?",
	"leading":"Big data becomes a relevant topic in many companies this year. Although there is no standard definition of the term ?big data¡°, Hadoop is the de facto standard for processing big data.",
	"author":"Kai Wihner",
	"source":"http://www.infoq.com",
	"created":1375127391000,
	"type":"TYPE1",
	"isFavorite":"false",
	"likeNum":3,
	"commentNum":4
},{
	"articleId":"00009",
	"title":"Implementing Kanban in Practice",
	"leading":"During our conversations with David J. Anderson, Kanban pioneer, at the Lean Kanban Conference in Chicago, we asked if there was any Kanban quick-start guide that might demystify things. David recommended we speak to Dr.",
	"author":"Vikram Gupta",
	"source":"http://www.infoq.com",
	"created":1375117321000,
	"type":"TYPE3",
	"isFavorite":"true",
	"likeNum":2,
	"commentNum":4
},
{
	"articleId":"00010",
	"title":"CloudMunch Launches a Full-Stack DevOps Platform",
	"leading":"CloudMunch Inc last month officially announced the launch of its freemium full-stack DevOps platform - a dashboard of pre-integrated tools for version control, build management, validation, automated testing, deployment and cloud connectors. ",
	"author":"Grischa Ekart",
	"source":"http://www.infoq.com",
	"created":1375194231000,
	"type":"TYPE3",
	"isFavorite":"false",
	"likeNum":12,
	"commentNum":12
},
{
	"articleId":"00011",
	"title":"Gartner's Technology Trends for Information Infrastructure: Big Data, NoSQL and In-Memory Computing",
	"leading":"Big Data, NoSQL databases and In-Memory computing are some of the technologies that will play key role in modernizing information management in 2013 and beyond, according to Gartner.",
	"author":"Srini Penchikala",
	"source":"http://www.infoq.com",
	"created":1375254931000,
	"type":"TYPE4",
	"isFavorite":"false",
	"likeNum":4,
	"commentNum":3
},
{
	"articleId":"00012",
	"title":"Making Time for Innovation in Enterprises",
	"leading":"To stay competitive, enterprises look for ways to do innovation inside their organization. A first step can be to make time available which people can use to think about new products and services and discuss ideas and develop concepts. Different approaches can be used, like establishing a dedicated ¡°full-time¡± team, arrange to have frequent innovation time, or organize short and intense innovation workshops.",
	"author":"Ben Linders",
	"source":"http://www.infoq.com",
	"created":1375166392000,
	"type":"TYPE5",
	"isFavorite":"false",
	"likeNum":10,
	"commentNum":12
}
]}