{"title":"PostSharp Has Just Gotten Much Easier",
"content":"<p><a href='http://www.postsharp.net/blog/post/Announcing-PostSharp-3-RTM.aspx'>PostSharp 3.0</a> brings with it deep integration with Visual Studio and NuGet. With a couple of mouse clicks PostSharp can apply aspects to a method in a clean project. All of the required packages for the aspect are automatically downloaded.</p><p>In some cases, additional information is needed. For example, adding a logging aspect for the first time will prompt the user for which logging framework they wish to use.</p><p><img alt='' width='350px' src='http://www.infoq.com/resource/news/2013/05/PostSharp-3/en/resources/logging-options.png' _href='img://logging-options.png' _p='true'></p><p>Depending on the framework chosen, some manual configuration may be needed. For example, Log4Net will still need a list of appenders in the app.config file.</p><p>A major concern with any Aspect Oriented Programming tool is the uncertainty about what the modified code will actually look like. PostSharp doesn¡¯t offer a preview, but it can launch a third party decompiler such as ILSpy, dotPeek, or Reflector.</p><p>This is the first version of PostSharp that works with Windows Store, Windows Phone and Silverlight. Support for these frameworks is offered via Portable Class Libraries. In order to work around the lack of a binary serializer in those frameworks, PostSharp is offering their own <a href='http://doc.postsharp.net/postsharp-3.0/Default.aspx##PostSharp-3.0.chm/html/T_PostSharp_Serialization_PortableFormatter.htm'>PortableFormatter</a> class.</p><p>Like many software vendors, PostSharp has decided to abandon the per-version pricing model. Developers on a budget can use the free version PostSharp Express. Those wanting more features will need to purchase a subscription that starts at $449 for Pro and $799 for the Ultimate Edition for one year. Additional years of support costs roughly 140 and 250/year respectively. Each license is per concurrent user, not per user, so licenses can be shared to some degree.</p>"
}