{"title":"NoSQL Database Adoption Trends",
"content":"<p><em>UPDATE Jul 25 2013: The following options were added today, after user request: Oracle Coherence, Terracotta BigMemory, Couchbase, and Oracle NoSQL Database.</em></p> <p>NoSQL databases have been getting lot of attention over the last few years for their performance, scalability, schema flexibility and analytics capabilities. While relational databases are still good choice for certain use cases - like structured data and applications that require ACID transactions - NoSQL databases are better suited for use cases where:</p> <ol> <li>The data stored is semi-structured or unstructured in nature</li> <li>The applications that access this data require a certain level of performance and scalability</li> <li>The applications that access this data are ok with eventual consistency</li> </ol> <p>Non-relational databases typically support the following capabilities:</p> <ul> <li>Schema flexibility</li> <li>Shared nothing architecture</li> <li>Sharding as part of the data storage model</li> <li>Asynchronous replication</li> <li>BASE instead of ACID Transactions</li> </ul> <p>InfoQ would like to learn what NoSQL databases you are currently using or planning on using in your applications.</p> <h2>Document Databases</h2> <ul> <li><a href='http://www.mongodb.org/'>MongoDB</a>: MongoDB is an open-source document oriented database.</li> <li><a href='http://couchdb.apache.org/'>CouchDB</a>: Apache CouchDB is a database that uses JSON for documents, JavaScript for MapReduce queries, and HTTP for an API.</li> <li><a href='http://www.couchbase.com/couchbase-open-source-project'>Couchbase</a>: NoSQL document database based on JSON model.</li> <li><a href='http://ravendb.net/'>RavenDB</a>: RavenDB is a document-oriented database based on .NET language.</li> <li>Other Document Database</li> </ul> <h2>Graph Databases&nbsp;</h2> <ul> <li><a href='http://www.neo4j.org/'>Neo4j</a>: Neo4j is a property graph database; supports ACID transactions.</li> <li><a href='http://www.objectivity.com/infinitegraph'>InfiniteGraph</a>: Graph database used to persist and traverse relationships between objects, supports distribute data stores.</li> <li><a href='http://www.franz.com/agraph/allegrograph/'>AllegroGraph</a>: AllegroGraph is a graph database that uses memory utilization in combination with disk-based storage for scalability, supports SPARQL, RDFS++, and Prolog reasoning.</li> <li>Other Graph Database</li> </ul> <h2>Key Value Data Stores&nbsp;</h2> <ul> <li><a href='http://basho.com/riak/'>Riak</a>: Riak is an open source, distributed key value database, supports data replication and fault-tolerance.</li> <li><a href='http://redis.io/'>Redis</a>: Redis is an open source key-value store. Supports master-slave replication, transactions, Pub/Sub, Lua scripting, Keys with a limited time-to-live.</li> <li><a href='http://aws.amazon.com/dynamodb/'>Dynamo</a>: Dynamo is a key-value distributed data store. It is directly implemented as Amazon DynamoDB; used in Amazon S3 product.</li> <li><a href='http://www.oracle.com/us/products/database/nosql/overview/index.html'>Oracle NoSQL Database</a>: Key-value NoSQL database from Oracle. It supports ACID transactions and JSON.</li> <li><a href='http://www.project-voldemort.com/voldemort/'>Voldemort</a>: Distributed key-value storage system with the data replication and partitioning.</li> <li><a href='http://www.aerospike.com/'>Aerospike</a>: Aerospike database is a key-value store; supports hybrid memory architecture and data integrity with strong or tunable consistency.</li> <li>Other Key Value Data Store</li> </ul> <h2>Columnar Databases&nbsp;</h2> <ul> <li><a href='http://cassandra.apache.org/'>Cassandra</a>: Cassandra is column database that supports data replication across multiple data centers. Its data model offers column indexes, log-structured updates, support for denormalization, materialized views, and built-in caching.</li> <li><a href='http://hbase.apache.org/'>HBase</a>: Apache HBase is an open-source, distributed, versioned, column-oriented store modeled after Google's Bigtable. It provides Bigtable-like capabilities on top of Hadoop and HDFS.</li> <li><a href='http://aws.amazon.com/simpledb/'>Amazon SimpleDB</a>: Amazon SimpleDB is a non-relational data store that offloads the work of database administration. Developers store and query data items using web services requests.</li> <li><a href='http://accumulo.apache.org/'>Apache Accumulo</a>: Apache Accumulo sorted, distributed key/value data store created based on Google's BigTable design and is built on top of Apache Hadoop, Zookeeper, and Thrift technologies.</li> <li><a href='http://hypertable.org/'>Hypertable</a>: Hypertable is an open source, scalable database, also modeled after Bigtable; supports sharding.</li> <li><a href='http://www.windowsazure.com/en-us/develop/net/how-to-guides/table-services/'>Azure Tables</a>: Windows Azure Table Storage Service offers NoSQL capabilities for applications that require storage of large amounts of unstructured data. Tables can auto-scale to store up to several terabytes of data. They are accessible via REST and managed APIs.</li> <li>Other Columnar Database</li> </ul> <h2>In-Memory Data Grids&nbsp;</h2> <ul> <li><a href='http://www.hazelcast.com/index.jsp'>Hazelcast</a>: Hazelcast CE is an open source data distribution platform. It allows the developers to share and partition the data across the database cluster.</li> <li><a href='http://www.oracle.com/technetwork/middleware/coherence/overview/index.html'>Oracle Coherence</a>: Oracle's in-memory data grid solution that provides fast access to frequently used data. Coherence supports event capabilities and dynamic partitioning of data.</li> <li><a href='http://terracotta.org/products'>Terracotta BigMemory</a>: Distributed in-memory management solution from Terracotta. The product includes an Ehcache interface, Terracotta Management Console and BigMemory-Hadoop Connector (early access).</li> <li><a href='http://www.vmware.com/products/application-platform/vfabric-gemfire'>GemFire</a>: VMware vFabric GemFire is a distributed data management platform and provides elastic in-memory data management, replication, partitioning, data-aware routing, and continuous querying.</li> <li><a href='http://www.jboss.org/infinispan/'>Infinispan</a>: Infinispan is a Java based open source key/value NoSQL datastore and distributed data grid platform. It supports transactions and peer-to-peer as well as client/server architecture.</li> <li>Other In-Memory Data Grid</li></ul>"
}