{"title":"Making Time for Innovation in Enterprises",
"content":"<p>To stay competitive, enterprises look for ways to do innovation inside their organization. A first step can be to make time available which people can use to think about new products and services and discuss ideas and develop concepts. Different approaches can be used, like establishing a dedicated ※full-time§ team, arrange to have frequent innovation time, or organize short and intense innovation workshops.</p> <p><a href='http://www.infoq.com/author/Jeff-Gothelf'>Jeff Gothelf</a> blogged about <a href='http://www.jeffgothelf.com/blog/building-in-house-innovation-teams-small-collocated-dedicated-self-sufficient/'>building in-house innovation teams</a>. He explains why it is important to build a team that is dedicated to innovation:</p> <blockquote> <p>As much as who you hire, structuring your teams effectively is key to a lean team＊s success. Many companies see the individual disciplines in their product development organization as service providers 每 internal agencies. The business reaches out to these agencies (engineering, UX/design, product management, et al), expresses a need for staffing and the discipline lead provides the resources based on expertise, availability and project fit. It sounds like a reasonable and efficient way to staff a project and to that extent it is 每 however, our goal should not be to simply staff a project but to build a team.</p> </blockquote> <p>According to Jeff, the criteria to have successful innovation teams are:</p> <blockquote><ul> <li>Small</li> <li>Collocated</li> <li>Dedicated</li> <li>Self-Sufficient</li> </ul></blockquote> <p>Small collocated teams can self-organize faster, and work together to decide and come up with innovative product ideas. Team members have to be dedicated to the team to have focus; together they form a multi disciplinary and self-sufficient team that can do what needs to be done.</p> <p>Jeff explains why it is important to have people who can fully dedicate their time to innovation:</p> <blockquote> <p>People dedicated to one team get the opportunity to focus. They know how to use their time 每 because their P1＊s are clear. They don＊t have to put off colleagues on one team 每 who are likely waiting on their work 每 to do work for another team. They produce better work and they do it more efficiently. Also, by focusing on the same problem statement consistently there is a greater chance for innovative breakthrough as opposed to the ※just get it done so I can move on§ attitude of managing multiple stakeholders. - See more at: http://www.jeffgothelf.com/blog/building-in-house-innovation-teams-small-collocated-dedicated-self-sufficient/#sthash.7dAdTVvV.dpuf</p> </blockquote> <p>Teams can change over time, it＊s important to keep focus on the team criteria and the goal for the innovation team:</p> <blockquote> <p>Over time, the unique context of your organization will morph this structure into one that makes the most sense for your company. However, I urge you to keep the underlying goal in mind as you modify this approach 每 what can we do, as an organization, to make it as easy as possible for our teams to succeed?</p> </blockquote> <p>Cyriel Kortleven wrote a blog about <a href='http://www.cyrielkortleven.com/innovation-requires-slack-time/'>innovation requires slack-time</a>. He explains how companies like Google, 3M and HP give time on a regular base to their employees to spend on new ideas and innovation, while other companies use <a href='http://www.infoq.com/news/2012/06/shipit-days'>ShipIt days</a> to develop new ideas for products. He mentions some things to keep in mind when organizations want to experiment with innovation time:</p> <blockquote><ul> <li>Start small, fail fast and learn fast</li> <li>Make time to have a time-off (allow ＆slack＊)</li> <li>Commitment from the top (and from employees)</li> </ul></blockquote> <p>There needs to be a culture where people feel safe to experiment, let go of things and think of something new, says Cyriel. He warns against time pressure for efficiency and too much control and detailed instructions from the top, management needs to support innovation and allow that time is spend on it.</p> <p>He concludes his blog with a spin-off that organizations can get from giving time off for innovation:</p> <blockquote> <p>(＃) [the result of these time off] will add value to the development of a good team and the self-esteem of the employees.</p> </blockquote> <p>The blog post <a href='http://streetsmartproductmanager.com/2013/04/26/applying-lean-techniques-in-a-big-company-the-hothouse/'>applying lean techniques in a big company: The Hothouse§</a> by Shardul Mehta describes a agile innovation workshop that senior business leaders and product development teams can use to solve key business problems. The workshop which they have called ※Hothouse§ combines the build-measure-learn approach from lean-startup with agile sprint reviews and retrospectives:&nbsp;</p> <blockquote> <p>The Hothouse takes place typically over 2 or 3 days. One to three small Sprint teams are assembled to work on specific business problems throughout those 2-3 days in a series of Creative Sprints that are typically about 3 hours each. (4 hours max, 2.5 hours minimum.) Between each Creative Sprint is a Design Review in which the teams present the deliverables from their last sprint to senior leaders, who provide constructive, actionable feedback to the teams. The teams take this feedback into the next Creative Sprint.</p> </blockquote> <p>The combined business and development team develops solutions for a small set of key business problems:</p> <blockquote> <p>For each business problem, teams bring in supporting material, such as existing customer research, current state user experience, business requirements, prototypes, architectural maps, etc. as inputs into the Hothouse. The expected outputs from the Hothouse depend on the business problems being addressed and the specific goals of the Hothouse, but can take the form of a refined and approved prototype, prioritized business requirements or stories, system impacts assessment, high-level delivery estimates, and even a marketing communication plan.</p> </blockquote> <p>Shardul sums up what the benefits are of these innovation workshops:</p> <blockquote> <ul> <li>Accelerates decision making</li> <li>Senior leadership involvement</li> <li>Ensures alignment across all stakeholders and teams</li> <li>This alignment serves as a much-needed baseline for the project post-Hothouse</li> <li>Faster product definition and solution development, which speeds delivery time-to-market</li> </ul></blockquote>"
}