{"title":"CloudMunch Launches a Full-Stack DevOps Platform",
"content":"<p><a href='http://www.cloudmunch.com/'>CloudMunch Inc</a> last month <a href='http://blog.cloudmunch.com/2013/04/cloudmunch-launches-first-full-stack.html'>officially announced</a> the launch of its freemium full-stack DevOps platform - a dashboard of pre-integrated tools for version control, build management, validation, automated testing, deployment and cloud connectors. The software is hosted and managed as a service (<a href='http://en.wikipedia.org/wiki/Software_as_a_service'>SaaS</a>) eliminating the need for developers to setup their own set of tools.</p> <p>Starting at $100 a month for private and free for open source projects, the product includes a wide range of features covering DevOps and Continuous Delivery from development to production. CloudMunch claims its platform significantly simplifies deployment of applications and infrastructure. The ambitious <a href='https://www.cloudmunch.com/features'>feature set</a> includes:</p> <ul> <li>GitHub integration with intuitive project import into CloudMunch</li> <li>Java, JavaScript, php, .NET, Ruby projects are supported</li> <li>Simplified Jenkins for Continuous Integration</li> <li>Developer tools integration such as most version control systems, Jira, Bugzilla</li> <li>IaaS and PaaS connectors for seamless provisioning and deployment</li> <li>Chef for deploy-anywhere continuous delivery</li> <li>Continuous application and infrastructure integration &amp; deployment</li> <li>Cross-team social collaboration integrated into the dashboard</li> <li>In-context, real-time analytics for build metrics</li> <li>Automated testing and code quality frameworks such as Selenium</li> <li>Monitoring of launched servers with AWS CloudWatch and Nagios</li> </ul> <p>CloudMunch integrates these disparate tools into a project-oriented dashboard, one of its main differentiators. The project metaphor allows for an intuitive workflow. CTO and cofounder Prasanna Raghavendra <a href='http://blog.cloudmunch.com/2013/02/job-centricity-vs-project-centricity.html'>explained in the company blog:</a></p> <blockquote>What we have done is to wrap Jenkins with project constructs so that it is easier to connect to the ALM world. Now one can link this to a release in a requirement management tool, and a project in defect tracking tool or a project management tool [...] Projects in the CloudMunch construct contain a branch, multiple jobs, multiple environments, multiple servers, a build progression workflow. All this wrapped in one entity helps evaluate software progress against its intended value, in a much better way.</blockquote> <p>With this feature set delivered as a service, Pradeep Prabhu, cofounder and CEO, claims its product offering is 'democratizing continuous delivery.' CloudMunch is available in an <a href='https://www.cloudmunch.com/pricing'>Express and a Pro edition</a>.</p>"
}