{"title":"Gartner's Technology Trends for Information Infrastructure: Big Data, NoSQL and In-Memory Computing",
"content":"<p>Big Data, NoSQL databases and In-Memory computing are some of the technologies that will play key role in modernizing information management in 2013 and beyond, according to <a href='http://www.gartner.com/'>Gartner</a>. A <a href='http://www.gartner.com/newsroom/id/2359715'>recent report</a> released by Gartner team identifies the top technology trends that will have impact on the information infrastructure and governance.</p> <p><strong>Big Data:</strong><br> <a href='http://www.gartner.com/technology/topics/big-data.jsp'>Big Data</a> technology is the management of high-volume, high-velocity and high-variety information assets that demand cost-effective and innovative forms of information processing for enhanced insight and decision making. The report says that Big Data warrants processing solutions for a variety of new and existing data to provide real business benefits but processing the size and variety of large data remains a technological solution unless it's tied to business goals. The important aspect of big data is not the technical ability to process the data but the benefits that can be realized by an organization using the Big Data analytics.</p> <p><strong>NoSQL Databases:</strong><br> <a href='http://en.wikipedia.org/wiki/NoSQL'>NoSQL databases</a> of all categories, key-value stores, document-style, table-style and graph databases, are designed to support new business use cases involving Web scale, mobile, and cloud environments. The report states that there is a significant gap between commercially supported NoSQL databases and open-source projects. Commercial product vendors can help the NoSQL database adoption and growth by adding enterprise-class features to their products. The awareness is still limited and business impact in 2012 was moderate, but it will increase in 2013 as more organizations investigate and experiment with the NoSQL databases.</p> <p><strong>In-Memory Computing:</strong><br> In-memory computing enables the organizations to develop applications that run advanced queries on large data sets or perform complex transactions&nbsp;faster compared to the techniques&nbsp;using conventional architectures. This emerging paradigm opens the unexplored opportunities for business innovation (e.g., real-time analysis of big data in motion) and cost reduction.</p> <p><strong>Semantic Technologies:</strong><br> Semantic technologies are used to extract meaning from data of different types (quantitative data, text, video, voice and images) for advanced statistics, data mining, machine learning and knowledge management. The renewed business requirement for monetizing information as a strategic asset is making semantic technologies get more attention recently. Also, the technical needs like using semantic technology to make sense out of data for humans or automate decisions are helping with the growth of this technology space.&nbsp;This is critical&nbsp;in the context of the management of increasing volume, variety and velocity of data and business operations that use the data to make decisions.</p> <p>Other technology trends mentioned in the report include Logical Data Warehouse, Chief Data Officer&nbsp;&amp; Other Information-Centric Roles, and Information Valuation/Infonomics.</p> <p>This report is part of Gartner's <a href='http://www.gartner.com/resId=2340315'>Top 10 Technology Trends Impacting Information Infrastructure, 2013</a>&nbsp;research report published in February.</p>"
}